<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>
<head>
<title>Untitled</title>
</head>
<body>
<p>Editar el documento <a href="/comunes/jtejedor/CSS_Tarea03.html" target="_blank" style="color:blue;font-weight:bold;"></a> y transformarlo utilizando CSS de forma que conserve el siguiente aspecto:</p>
<p><b>Ayudas:</b></p>
<p>Estas son algunas ayudas que servir&aacute;n para orientar al alumno en la resoluci&oacute;n de la tarea.</p>
<p>En este ejemplo podemos ver que el titulo principal del documento aplica las llamadas versalitas y est&aacute; subrayado y sobrerrayado.</p>
<p>La imagen de fondo no ocupa todo el lienzo del documento y aparecer&aacute; centrada verticalmente y alineada a la derecha horizontalmente. Adem&aacute;s no se deslizar&aacute; con las barras de desplazamiento (scroll).</p>
<p>El t&iacute;tulo de cada pel&iacute;cula presenta una imagen de fondo, que se repite a lo largo de todo el ancho. Puesto que la altura de la imagen no depender&aacute; del tama&ntilde;o de la fuente, tendremos que considerar c&oacute;mo situar el fondo y qué tipo de repetici&oacute;n deber&aacute; presentar.</p>
<p>Las im&aacute;genes de estatuillas aparecen en el fondo de los p&aacute;rrafos. En unos alineados a la derecha, y en otros a la izquierda, y siempre se comienzan a representar desde la parte superior del texto.</p>
<p>Los enlaces internos, que nos llevan desde el premio a la sinopsis de la pel&iacute;cula, no presentan el color usual de este tipo de elementos que el navegador aporta. Deberemos cambiarlo, y dotarles de una decoraci&oacute;n distinta (subrayando u otro estilo decorativo de los que se han estudiado).</p>
<p>El nombre de cada actor (Ian McKellen, Bernard Hill...)se ha resaltado mediante los estilo asignados a una clase, tal y como se puede comprobar en el c&oacute;digo HTML original. De modo que deberemos a&ntilde;adir también una regla definida para esa clase.</p>
<div style="text-align:center;"><img src="CSS_Tarea03.gif"></div>
<p><b>Recursos de la tarea:</b></p>
<p>Puede descargar el documento <a href="CSS_Tarea03.zip" style="color:red; font-weight:bold;">CSS_Tarea03.zip</a> donde encontrar&aacute; tanto el fichero HTML a editar como las im&aacute;genes necesarias para la visualizaci&oacute;n del documento final.</p>
</body>
</html>
